trade_exp/src/InformationRegisters/АкадемияИзучение/АкадемияИзучение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="a5921bba-9a96-45b7-b031-23b3ccf24e50">
  <name>АкадемияИзучение</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="452a0b84-9691-4213-a569-af216dc2bda0">
    <name>Изучено</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="14e0380f-c343-49cb-bf2e-17a34dcbfa9f">
    <name>ПродублированыЗаписиИзучения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3b45ad2-94b5-45aa-be34-f8e4b18dfb10">
    <name>ПоследнееОбновление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="9f4176f3-d622-405e-8b99-d54149eb936f">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="f2997b60-0014-45d8-a518-d0dc17e5ffde">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="61bdbd5a-4297-4a85-b8a9-59f9df0bfc60">
    <name>Тема</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f211be6c-33a4-43ed-9457-66e053a2fc9a">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/АкадемияТестирование/АкадемияТестирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bc9e54ab-e3fc-4f06-8d4d-92087a90e56f">
  <name>АкадемияТестирование</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="a4e5b28c-652e-452b-98a1-d62f04ef7a96">
    <name>Баллы</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5a7caefb-10fd-412e-8cb4-e184f0f03573">
    <name>ЗатраченноеВремя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="19d5334f-afb2-488b-bcd0-9dd0b8bd3553">
    <name>ВремяВСекундах</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="ace93464-dc04-425b-a407-1c96365b3def">
    <name>Обнулен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a59fb370-9cc2-4f30-8cb8-7a3fca53fcec">
    <name>ТестПройден</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="5878dcc1-00bd-40aa-b870-a06e47e5c087">
    <name>ПоследнееОбновление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4db3064b-1d58-4314-81d4-4fd187d574b1">
    <name>ПродублированыЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="437f4663-3339-4dc5-81eb-d35a22d702a5">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="7ec87170-4688-4f58-ae51-5e63faf52f6c">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="42d37e85-650a-4f97-a979-5a3e0da60c69">
    <name>Тема</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3940f163-f3c3-489c-86a0-45dc68f399ee">
    <name>Главный</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="35fc4e2d-ffe1-4c84-9e0d-632a3167d63e">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="137e9d0f-087b-4b88-983d-2fc2a2ff2ab5">
    <name>ЕстьТесты</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3cfce2fa-e0d2-4c8a-a4b8-8732ab159072">
    <name>IDПопытки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/АкадемияДолжностьЗакрепленныйМатериал/АкадемияДолжностьЗакрепленныйМатериал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d04c1c6b-da88-46a3-b255-b2897c5793f2">
  <name>АкадемияДолжностьЗакрепленныйМатериал</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="db7fd2de-e975-4a26-8287-2442dfc0a706">
    <name>ЕстьГлавныйИМиниТест</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="17343571-4ca2-47b8-bf12-7274ea517341">
    <name>Должность</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="34621758-0823-45e5-bf7e-a7b5d3912c6b">
    <name>Тема</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="5757745b-8f1a-4997-9107-850ac532beb6">
    <name>Отдел</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/CommonModules/Академия/Module.bsl
Процедура Импорт() Экспорт
    вн = ТекущаяДата();
    
    ТекДата = ТекущаяДата();
    url = ПолучитьUrl(ТекДата);    
    АдресДокJSON = ИмпортДанных(url);
    Если АдресДокJSON = null Тогда
        Сообщить("Ошибка чтения данных с сервера " + url);
        Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
    
	ВыборкаТема = Справочники.ТемыАкадемии.ВыбратьИерархически();
	Пока ВыборкаТема.Следующий() Цикл
		ОбъектСправочника = ВыборкаТема.ПолучитьОбъект();
		ОбъектСправочника.Удалить();
	КонецЦикла;
	
	ВыборкаТест = Справочники.ТестыАкадемии.Выбрать();
	Пока ВыборкаТест.Следующий() Цикл
		ОбъектСправочника = ВыборкаТест.ПолучитьОбъект();
		ОбъектСправочника.Удалить();
	КонецЦикла; 

    РегистрыСведений.АкадемияИзучение.СоздатьНаборЗаписей().Записать();
    РегистрыСведений.АкадемияТестирование.СоздатьНаборЗаписей().Записать();
    РегистрыСведений.АкадемияДолжностьЗакрепленныйМатериал.СоздатьНаборЗаписей().Записать();

    ЗаполнитьИерархическийСправочникТем(АдресДокJSON, "study_material");
    ЗаполнениеДолжностьТема(ПрочитатьТзИзФайла(АдресДокJSON, "dep_tasks"));
    ЗаполнениеИзучения(ПрочитатьТзИзФайла(АдресДокJSON, "studied"));
	ЗаполнитьТестирования(ПрочитатьТзИзФайла(АдресДокJSON, "test"));
	
	УстановитьПривилегированныйРежим(Ложь);
    
    вв = Число(Формат(УниверсальноеВремя(ТекущаяДата()) - Дата('19700101'), "ЧГ=0") - Формат(УниверсальноеВремя(вн) - Дата('19700101'), "ЧГ=0"));
    мин = Цел(вв/60);
    сек = вв - мин * 60;
    Сообщить("Время выполнения: " + мин + " мин. " + сек + " сек.");
КонецПроцедуры

Функция ИмпортДанных(url)
    метка = СтрНайти(url , "/api/");
    Домен = Прав(Лев(url, метка-1), метка - 1 - СтрДлина("https://"));
    Путь = Прав(url, СтрДлина(url)-метка+1);
    Соединение = Новый HTTPСоединение(Домен, 443 ,,,,, Новый ЗащищенноеСоединениеOpenSSL());  
    Запрос = Новый HTTPЗапрос(Путь);
    Результат = Соединение.Получить(Запрос);
    Если (Результат.КодСостояния <> 200) Тогда
        Возврат null; 
    КонецЕсли;
    ТекстJSON = Результат.ПолучитьТелоКакСтроку();
    АдресДокJSON = ПоместитьВоВременноеХранилище(ТекстJSON, Новый УникальныйИдентификатор());
    Возврат АдресДокJSON;
КонецФункции

Функция ПолучитьUrl(Дата)
    secretKey1 = "85Sfz4PCsVp8D58lY17A692QVtoRpduj";
    secretKey2 = "l28VgVTXikq2sSondbbKOzs1kJScIAsD";
    date = Формат(Дата, "ДФ=yyyy-MM");
    nonce = Формат(УниверсальноеВремя(ТекущаяДата()) - Дата('19700101'), "ЧГ=0");
    sign = "f" + НРег(ПолучитьHexСтрокуИзДвоичныхДанных(HMAC(
                    ПолучитьДвоичныеДанныеИзСтроки(secretKey2),
                    ПолучитьДвоичныеДанныеИзСтроки(date + nonce + secretKey1),
                    ХешФункция.SHA512, 128 )));
					
	url = "https://academy.tg-alterra.ru/api/data?sign=" + sign + "&nonce=" + nonce + "&date=" + date;
	
    сообщить(url);
    Возврат url;
КонецФункции

Функция ЗаполнитьИерархическийСправочникТем(АдресДокJSON, ИмяНабораЗаписей)
    ЧтJSON = Новый ЧтениеJSON;
    ЧтJSON.УстановитьСтроку(ПолучитьИзВременногоХранилища(АдресДокJSON));
    Данные = ПрочитатьJSON(ЧтJSON);
    ЧтJSON.Закрыть();
    
    Для Каждого Стр Из Данные[ИмяНабораЗаписей] Цикл
        СоздатьИерархиюТем(Стр, null);
    КонецЦикла
КонецФункции

Процедура СоздатьИерархиюТем(Стр, parent_id)
    Перем Подчиненные;
    ЕстьПодчиненные = Стр.Свойство("child", Подчиненные);
    Если ( ЕстьПодчиненные ) Тогда
       СоздатьТему(Стр.id, Стр.name + " ("+ Подчиненные.Количество() + ")", Стр.type, parent_id, Истина, ?(Стр.test.Количество() > 0,Истина,Ложь));
	   Если Стр.test.Количество() > 0 Тогда
		   СоздатьТест(Стр.id, Стр.name, Стр.test);
	   КонецЕсли;
       Для Каждого Стр2 Из Подчиненные Цикл
            СоздатьИерархиюТем(Стр2, Стр.id);
       КонецЦикла
    Иначе
       СоздатьТему(Стр.id, Стр.name, Стр.type, parent_id, Ложь, ?(Стр.test.Количество() > 0,Истина,Ложь));
	   Если Стр.test.Количество() > 0 Тогда
		   СоздатьТест(Стр.id, Стр.name, Стр.test);
	   КонецЕсли;
    КонецЕсли    
КонецПроцедуры

Процедура СоздатьТест(id, name, test)
	
	Для каждого Тест Из test Цикл
		НовыйТест = Справочники.ТестыАкадемии.СоздатьЭлемент();
		НовыйТест.Код = id;
		НовыйТест.Наименование = name;
		НовыйТест.ИДТеста = Тест;
		НовыйТест.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьТему(id, name, type, parent_id, category = Ложь, testing = Ложь)
    Перем Родитель;
    
    ТипТемыСсылка = Справочники.ТипыТемАкадемии.НайтиПоНаименованию(type);
    Если ТипТемыСсылка = Справочники.ТипыТемАкадемии.ПустаяСсылка() Тогда
        НовыйТипТемы = Справочники.ТипыТемАкадемии.СоздатьЭлемент();
        НовыйТипТемы.Наименование = type;
        НовыйТипТемы.Записать();
        ТипТемыСсылка = НовыйТипТемы.Ссылка;
    КонецЕсли;
    
    Если (parent_id = null) Тогда
        Родитель = Справочники.ТемыАкадемии.НайтиПоНаименованию(type);
        Если Родитель = Справочники.ТемыАкадемии.ПустаяСсылка() Тогда
            НоваяТема = Справочники.ТемыАкадемии.СоздатьЭлемент();
            НоваяТема.Код = 999000000 + ТипТемыСсылка.Код;
            НоваяТема.Наименование = type;
			НоваяТема.СодержитДопТемы = category;
			НоваяТема.Тестирование = testing;
            НоваяТема.Записать();
            Родитель = НоваяТема.Ссылка;
        КонецЕсли;
    Иначе
        Родитель = Справочники.ТемыАкадемии.НайтиПоКоду(parent_id);
    КонецЕсли;

    НоваяТема = Справочники.ТемыАкадемии.СоздатьЭлемент();
    НоваяТема.Код = id;
    НоваяТема.Наименование = ОбработатьНаименование(name);
    НоваяТема.ТипТемы = ТипТемыСсылка;
    НоваяТема.Родитель = Родитель;
	НоваяТема.СодержитДопТемы = category;
	Если Родитель.Код > 999000000 Тогда
		НоваяТема.Тестирование = Истина;
	Иначе
		НоваяТема.Тестирование = testing;
	КонецЕсли; 
    НоваяТема.Записать();    
КонецПроцедуры  

Функция ОбработатьНаименование(Знач Наименование)  
	ПродолжитьПоиск = Истина;
	Пока ПродолжитьПоиск Цикл
		КонечнаяПозиция = СтрНайти(Наименование,")",НаправлениеПоиска.СКонца);
		НачальнаяПозиция = СтрНайти(Наименование,"(",НаправлениеПоиска.СКонца);
		Если НачальнаяПозиция <> 0 И КонечнаяПозиция <> 0 Тогда
			Наименование = СтрЗаменить(Наименование,Сред(Наименование,НачальнаяПозиция,КонечнаяПозиция - НачальнаяПозиция + 1),"");
			Наименование = СокрЛП(СтрЗаменить(Наименование,"  "," "));
		Иначе
			ПродолжитьПоиск = Ложь;
		КонецЕсли;	
	КонецЦикла;  
	Возврат Наименование;
КонецФункции	

Функция ПрочитатьТзИзФайла(АдресДокJSON, ИмяНабораЗаписей)  
    ЧтJSON = Новый ЧтениеJSON;
    ЧтJSON.УстановитьСтроку(ПолучитьИзВременногоХранилища(АдресДокJSON));
    Данные = ПрочитатьJSON(ЧтJSON);
    ЧтJSON.Закрыть();               
    
    ТЗ = Новый ТаблицаЗначений;
    
    Массив = Новый Массив;
    Массив.Добавить(Тип("Дата"));
    ОписаниеТиповДаты = Новый ОписаниеТипов(Массив, , , , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
    
    Массив.Очистить();
    Массив.Добавить(Тип("Строка"));
    ОписаниеТиповСтроки = Новый ОписаниеТипов(Массив, , , , Новый КвалификаторыСтроки(150));
    
    Массив.Очистить();
    Массив.Добавить(Тип("Число"));
    ОписаниеТиповЧисла = Новый ОписаниеТипов(Массив, , , Новый КвалификаторыЧисла(10,0));

    Массив.Очистить();
    Массив.Добавить(Тип("Булево"));
    ОписаниеТиповБулево = Новый ОписаниеТипов(Массив);

    Если ИмяНабораЗаписей = "dep_tasks" Тогда
        ТЗ.Колонки.Добавить("proff_code", ОписаниеТиповСтроки);
        ТЗ.Колонки.Добавить("theme_id", ОписаниеТиповЧисла);
		ТЗ.Колонки.Добавить("department_id", ОписаниеТиповЧисла);
		ТЗ.Колонки.Добавить("department_code", ОписаниеТиповСтроки);
    КонецЕсли;
    
    Если ИмяНабораЗаписей = "studied" Тогда
        ТЗ.Колонки.Добавить("client_code", ОписаниеТиповСтроки);
        ТЗ.Колонки.Добавить("theme_id", ОписаниеТиповЧисла);
        ТЗ.Колонки.Добавить("date", ОписаниеТиповДаты);
	КонецЕсли;
	
	Если ИмяНабораЗаписей = "test" Тогда
		ТЗ.Колонки.Добавить("id", ОписаниеТиповЧисла);
        ТЗ.Колонки.Добавить("client_code", ОписаниеТиповСтроки);
        ТЗ.Колонки.Добавить("theme_id", ОписаниеТиповЧисла);
		ТЗ.Колонки.Добавить("test_id", ОписаниеТиповЧисла);
        ТЗ.Колонки.Добавить("date", ОписаниеТиповДаты);
		ТЗ.Колонки.Добавить("score", ОписаниеТиповЧисла);
		ТЗ.Колонки.Добавить("time", ОписаниеТиповСтроки);
		ТЗ.Колонки.Добавить("seconds", ОписаниеТиповЧисла);
		ТЗ.Колонки.Добавить("is_reset", ОписаниеТиповСтроки);
		ТЗ.Колонки.Добавить("is_main_test", ОписаниеТиповСтроки);
		ТЗ.Колонки.Добавить("finished", ОписаниеТиповБулево);
    КонецЕсли;
    
    ЗаполнитьТаблицуИзJSON(Данные[ИмяНабораЗаписей], ТЗ);

    Возврат ТЗ;
КонецФункции

Процедура ЗаполнитьТаблицуИзJSON(мДанные, ТЗ)
    
    Для Каждого ЭлементМассива из мДанные Цикл
        Строка = ТЗ.Добавить();
        
        Для Каждого Запись Из ЭлементМассива Цикл
            Колонка = Запись.Ключ;
            Если Колонка = "date" Тогда
                Зн = Запись.Значение;
                Если Зн="-" Тогда
                    Строка[Колонка] = Null;
                Иначе
                    стр = СтрЗаменить(Зн, "-", "");
                    стр = СтрЗаменить(стр, " ", "");
                    стр = СтрЗаменить(стр, ":", "");
                    стр = СтрЗаменить(стр, "+00", "");
                    Строка[Колонка] = Дата(стр);
                КонецЕсли;
            ИначеЕсли Колонка = "count_tries" Или Колонка = "score" Тогда
                Строка[Колонка] = Число(Запись.Значение);
			ИначеЕсли Колонка = "time" Тогда
			    Зн = Запись.Значение;
			    Зн = СтрЗаменить(Зн, " мин. ", "/");
			    Зн = СтрЗаменить(Зн, " с.", "");
			    м = СтрРазделить(Зн, "/");
			    к = м.Количество();
			    в = 0;
			    Если к = 2 Тогда
			        в = Число(м[0]) * 60 + Число(м[1]);    
			    ИначеЕсли к = 1 Тогда
			        в = Число(м[0]);    
			    КонецЕсли;
			    Строка["seconds"] = в;
				Строка[Колонка] = Запись.Значение;
            ИначеЕсли Колонка = "result" Тогда
                Зн = Запись.Значение;
                Строка["is_test"] = ?(Зн = "Не пройден" Или Зн = "Тест пройден", Истина, Ложь);
                Строка["result"] = ?(Зн = "Не пройден" Или Зн = "Не изучено", Ложь, Истина);
            Иначе
                Зн = Запись.Значение;
                Если Зн = "Да" Тогда
                    Строка[Колонка] = Истина;
                ИначеЕсли Зн = "Нет" Тогда
                    Строка[Колонка] = Ложь;
                Иначе
                    Строка[Колонка] = Запись.Значение;
                КонецЕсли;
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;
 
КонецПроцедуры

Процедура ЗаполнениеДолжностьТема(ТЗ)
    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ТЗ.proff_code КАК proff_code,
    |	ТЗ.theme_id КАК theme_id,
    |	ТЗ.department_code КАК department_code
    |ПОМЕСТИТЬ TЗ_dep_tasks
    |ИЗ
    |	&_ТЗ КАК ТЗ
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	Должности.Ссылка КАК Должность,
    |	ТемыАкадемии.Ссылка КАК Тема,
    |	Отделы.Ссылка КАК Отдел
    |ИЗ
    |	TЗ_dep_tasks КАК TЗ_dep_tasks
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
    |		ПО TЗ_dep_tasks.proff_code = Должности.Код
    |			И (НЕ Должности.ПометкаУдаления)
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТемыАкадемии КАК ТемыАкадемии
    |		ПО TЗ_dep_tasks.theme_id = ТемыАкадемии.Код
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Отделы КАК Отделы
    |		ПО TЗ_dep_tasks.department_code = Отделы.Код
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудник
    |		ПО (Сотрудник.Должность = Должности.Ссылка)
    |			И (Сотрудник.Отдел = Отделы.Ссылка)
    |
    |СГРУППИРОВАТЬ ПО
    |	Должности.Ссылка,
    |	ТемыАкадемии.Ссылка,
    |	Отделы.Ссылка";
    
    Запрос.УстановитьПараметр("_ТЗ", ТЗ);
    Результат = Запрос.Выполнить().Выгрузить();
        
    Набор = РегистрыСведений.АкадемияДолжностьЗакрепленныйМатериал.СоздатьНаборЗаписей();
    Набор.Загрузить(Результат);
    Набор.Записать();

КонецПроцедуры

Процедура ЗаполнениеИзучения(ТЗ)
    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ТЗ.client_code КАК client_code,
    |   ТЗ.theme_id КАК theme_id,
    |   ТЗ.date КАК dt
    |ПОМЕСТИТЬ TЗ_studied
    |ИЗ
    |   &_ТЗ КАК ТЗ
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ТемыАкадемии.Ссылка КАК Тема,
    |   Сотрудники.Ссылка КАК Сотрудник,
    |   TЗ_studied.dt КАК Дата
    |ИЗ
    |   TЗ_studied КАК TЗ_studied
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТемыАкадемии КАК ТемыАкадемии
    |       ПО TЗ_studied.theme_id = ТемыАкадемии.Код
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
    |       ПО TЗ_studied.client_code = Сотрудники.Код";
    
    Запрос.УстановитьПараметр("_ТЗ", ТЗ);
    Результат = Запрос.Выполнить().Выгрузить();
        
    Набор = РегистрыСведений.АкадемияИзучение.СоздатьНаборЗаписей();
    Набор.Загрузить(Результат);
    Набор.Записать();

КонецПроцедуры

Процедура ЗаполнитьТестирования(ТЗ);
	
	Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ТЗ.client_code КАК client_code,
    |	ТЗ.theme_id КАК theme_id,
    |	ТЗ.date КАК dt,
    |	ТЗ.score КАК score,
    |	ТЗ.time КАК time,
	|	ТЗ.seconds КАК seconds,
    |	ТЗ.is_reset КАК is_reset,
    |	ТЗ.finished КАК finished,
    |	ТЗ.id КАК id,
    |	ВЫБОР
    |		КОГДА ТЗ.theme_id <> 0
    |			ТОГДА ИСТИНА
    |	КОНЕЦ КАК is_main,
    |	ТЗ.test_id КАК test_id
    |ПОМЕСТИТЬ TЗ_test
    |ИЗ
    |	&_ТЗ КАК ТЗ
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	TЗ_test.client_code КАК client_code,
	|	ВЫБОР
	|		КОГДА TЗ_test.theme_id <> 0
	|			ТОГДА TЗ_test.theme_id
	|		ИНАЧЕ ТестыАкадемии.Код
	|	КОНЕЦ КАК theme_id,
	|	TЗ_test.dt КАК dt,
	|	TЗ_test.score КАК score,
	|	TЗ_test.time КАК time,
	|	TЗ_test.seconds КАК seconds,
	|	TЗ_test.is_reset КАК is_reset,
	|	TЗ_test.finished КАК finished,
	|	TЗ_test.id КАК id,
	|	TЗ_test.is_main КАК is_main
	|ПОМЕСТИТЬ test
	|ИЗ
	|	TЗ_test КАК TЗ_test
	|		Левое СОЕДИНЕНИЕ Справочник.ТестыАкадемии КАК ТестыАкадемии
	|		ПО TЗ_test.test_id = ТестыАкадемии.ИДТеста
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ТемыАкадемии.Ссылка КАК Тема,
    |	Сотрудники.Ссылка КАК Сотрудник,
    |	test.dt КАК Дата,
    |	test.score КАК Баллы,
    |	test.time КАК ЗатраченноеВремя,
	|	test.seconds КАК ВремяВСекундах,
    |	test.is_reset КАК Обнулен,
    |	test.finished КАК ТестПройден,
    |	test.id КАК IDПопытки,
    |	test.is_main КАК Главный
    |ИЗ
    |	test КАК test
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
    |		ПО test.client_code = Сотрудники.Код
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТемыАкадемии КАК ТемыАкадемии
    |		ПО test.theme_id = ТемыАкадемии.Код";
    
    Запрос.УстановитьПараметр("_ТЗ", ТЗ);
    Результат = Запрос.Выполнить().Выгрузить();
        
    Набор = РегистрыСведений.АкадемияТестирование.СоздатьНаборЗаписей();
    Набор.Загрузить(Результат);
    Набор.Записать();

КонецПроцедуры

#Область ДублированиеИз_ОбщегоМодуля_РаботаВМоделиСервисаБТС

Функция HMAC(Знач Ключ, Знач Данные, Тип, РазмерБлока)
	
	Если Ключ.Размер() > РазмерБлока Тогда
		Ключ = Хеш(Ключ, Тип);
	КонецЕсли;
	
	Если Ключ.Размер() < РазмерБлока Тогда
		Ключ = ПолучитьHexСтрокуИзДвоичныхДанных(Ключ);
		Ключ = Лев(Ключ + ПовторитьСтроку("00", РазмерБлока), РазмерБлока * 2);
	КонецЕсли;
	
	Ключ = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ПолучитьДвоичныеДанныеИзHexСтроки(Ключ));
	
	ipad = ПолучитьБуферДвоичныхДанныхИзHexСтроки(ПовторитьСтроку("36", РазмерБлока));
	opad = ПолучитьБуферДвоичныхДанныхИзHexСтроки(ПовторитьСтроку("5c", РазмерБлока));
	
	ipad.ЗаписатьПобитовоеИсключительноеИли(0, Ключ);
	ikeypad = ПолучитьДвоичныеДанныеИзБуфераДвоичныхДанных(ipad);
	
	opad.ЗаписатьПобитовоеИсключительноеИли(0, Ключ);
	okeypad = ПолучитьДвоичныеДанныеИзБуфераДвоичныхДанных(opad);
	
	Возврат Хеш(СклеитьДвоичныеДанные(okeypad, Хеш(СклеитьДвоичныеДанные(ikeypad, Данные), Тип)), Тип);
	
КонецФункции

Функция Хеш(ДвоичныеДанные, Тип)	
	Хеширование = Новый ХешированиеДанных(Тип);
	Хеширование.Добавить(ДвоичныеДанные);
	Возврат Хеширование.ХешСумма;
КонецФункции

Функция СклеитьДвоичныеДанные(ДвоичныеДанные1, ДвоичныеДанные2)
	МассивДвоичныхДанных = Новый Массив;
	МассивДвоичныхДанных.Добавить(ДвоичныеДанные1);
	МассивДвоичныхДанных.Добавить(ДвоичныеДанные2);
	Возврат СоединитьДвоичныеДанные(МассивДвоичныхДанных);	
КонецФункции

Функция ПовторитьСтроку(Строка, Количество)
	Части = Новый Массив(Количество);
	Для к = 1 По Количество Цикл
		Части.Добавить(Строка);
	КонецЦикла;
	Возврат СтрСоединить(Части, "");	
КонецФункции

#КонецОбласти

Функция ПреобразоватьВремя(Время) Экспорт
	
	Перем Часы, Минуты, Секунды;
	
	Если Время <> Null Тогда
		
		Часы = Цел(Время / 3600);
		Время = Время % 3600;
		Минуты = Цел(Время / 60);
		Секунды = Время % 60;
		
		Возврат("" + ?(Часы > 0, "" + Часы + " ч. ", "") + Минуты + " мин. " + ?(Секунды>0, Формат(Секунды, "ЧДЦ=0"), Секунды) + " с.");
		
	Иначе
		
		Возврат("0 мин. 0 с.");
	
	КонецЕсли; 
	
КонецФункции

Функция ПреобразоватьВремяСотые(Время) Экспорт
	Перем Часы;
	Если Время <> Null Тогда
		Часы = Формат(Время / 3600, "ЧДЦ=2; ЧГ=0");
		Возврат Часы;
	Иначе
		Возврат 0;
	КонецЕсли; 
КонецФункции
